# GetPlantToolInitialized

## Description
Returns whether or not the plant tool has been initialized or not.

```pascal
FUNCTION GetPlantToolInitialized : BOOLEAN;
```

```python
def vs.GetPlantToolInitialized():
    return BOOLEAN
```

## Version
Availability: from VectorWorks13.0

## Category
* Utility